comsys/routing.html
---
layout: page
title: Routing und Forwarding
---


<p>
Zwei Methoden zur Bestimmung von Routen (Routing):
</p>

<ul class="org-ul">
<li><a href="#sec-2-1">2.1</a>
</li>
<li><a href="#sec-2-2">2.2</a>
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Routing Tabellen</h2>
<div class="outline-text-2" id="text-1">
<p>
routing tables enthalten u.a.:
</p>

<ul class="org-ul">
<li>destination address
</li>
<li>next hp
</li>
<li>interface
</li>
</ul>

<p>
Arten von Einträgen
</p>

<ul class="org-ul">
<li><b>network route</b>: destination address ist Adresse eines Netzwerks (z.B.
10.0.2.0/24)
</li>
<li><b>host route</b>: destination adress ist Adresse eines Hosts (z.B. 10.0.2.2/32)
</li>
<li><b>default route</b>: destination address ist die ungültige Adresse
0.0.0.0/0
<ul class="org-ul">
<li>durch die Verwendung einer 0-bit Präfix wird dafür gesorgt, dass
alle Pakete, deren Zieladdresse zu keinem anderen Eintrag in der
routing table passt an die default route weitergeleitet werden
</li>
<li>genutzt für das <b>standardgateway</b>
</li>
</ul>
</li>
<li><b>loopback address</b>:
<ul class="org-ul">
<li>unter Linux existiert kein Eintrag für die loopback address in der
routing table. ein loopback wird durch den Kernel erkannt und
behandelt (und nicht an ein Interfaceweitergeleitet)
</li>
</ul>
</li>
</ul>

<p>
Das Nachschlagen einer destination address in einer routing table
erfolgt mit Hilfe des <b>longest prefix match</b>. D.h. ein Paket wird an den
Eintrag in der routing table, dessen Netzwerkpräfix die längsten
Übereinstimmung mit der Zieladresse aufweist. Das ermöglich die
Aggregation Adressen in routing tables und führt somit zu kleineren
routing tables. 
</p>

<ul class="org-ul">
<li>um das longest prefix match effizient bestimmen zu können werden
die Präfix der Einträge der routing table als Baum repräsentiert
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Aktualisierung von Routing Tabellen</h2>
<div class="outline-text-2" id="text-2">
<p>
Routing Tabellen sind veränderbar durch:
</p>

<ul class="org-ul">
<li>manuelle Konfiguration von routen
</li>
<li>ICMP Nachrichten
</li>
<li>Hinzufügen eines Interface zum lokalen Knoten
</li>
<li>Aktualisierungen durch Routing Protokolle
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Distance Vector Routing</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Router senden Distanzvektoren an adjazente Knoten 
</li>
<li>Bestimmung der routing table mit dem
<a href="../ads/kuerzeste_wege.org::*Algorithmus von
  Bellman-Ford">Algorithmus von Bellman-Ford</a>
</li>
<li>Protokoll: <b>Routing Information Protokoll</b> (RIP)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Link State Routing</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Router senden Informationen (up/down, cost) über ihre direkten links
an alle anderen Router
</li>
<li>jeder Router bildet daraus eine "Karte des Netzwerks"
</li>
<li>Bestimmung des kürzesten Wegs mit dem
<a href="../ads/kuerzeste_wege.html#sec-1-2">Algorithmus von Dijkstra</a>
</li>
<li>Protokoll: <b>Open Shortest Path First</b> (OSPF)
</li>
</ul>
</div>
</div>
</div>
